In [1]:
pip install sqlalchemy psycopg2 pandas

Requirement already satisfied: sqlalchemy in /usr/local/lib/python3.7/dist-packages (1.4.25)
Requirement already satisfied: psycopg2 in /usr/local/lib/python3.7/dist-packages (2.7.6.1)
Requirement already satisfied: pandas in /usr/local/lib/python3.7/dist-packages (1.1.5)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.7/dist-packages (from sqlalchemy) (1.1.2)
Requirement already satisfied: importlib-metadata in /usr/local/lib/python3.7/dist-packages (from sqlalchemy) (4.8.1)
Requirement already satisfied: numpy>=1.15.4 in /usr/local/lib/python3.7/dist-packages (from pandas) (1.19.5)
Requirement already satisfied: pytz>=2017.2 in /usr/local/lib/python3.7/dist-packages (from pandas) (2018.9)
Requirement already satisfied: python-dateutil>=2.7.3 in /usr/local/lib/python3.7/dist-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.7/dist-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)
Requirement already satisfied: typing-extensions>=3.6.4 in /usr/local/lib/python3.7/dist-packages (from importlib-metadata->sqlalchemy) (3.7.4.3)
Requirement already satisfied: zipp>=0.5 in /usr/local/lib/python3.7/dist-packages (from importlib-metadata->sqlalchemy) (3.6.0)

In [1]:
import psycopg2 as pg
import pandas as pd

connection = pg.connect(host='pgsql-196447.vipserv.org', port=5432, dbname='wbauer_adb', user='wbauer_adb', password='adb2020')

/usr/local/lib/python3.7/dist-packages/psycopg2/__init__.py:144: UserWarning: The psycopg2 wheel package will be renamed from release 2.8; in order to keep installing from binary please use "pip install psycopg2-binary" instead. For details see: <http://initd.org/psycopg/docs/install.html#binary-install-from-pypi>.
  """)

In [2]:
df = pd.read_sql('select * from category',con=connection)
print(df)

    category_id         name         last_update
0             1       Action 2006-02-15 09:46:27
1             2    Animation 2006-02-15 09:46:27
2             3     Children 2006-02-15 09:46:27
3             4     Classics 2006-02-15 09:46:27
4             5       Comedy 2006-02-15 09:46:27
5             6  Documentary 2006-02-15 09:46:27
6             7        Drama 2006-02-15 09:46:27
7             8       Family 2006-02-15 09:46:27
8             9      Foreign 2006-02-15 09:46:27
9            10        Games 2006-02-15 09:46:27
10           11       Horror 2006-02-15 09:46:27
11           12        Music 2006-02-15 09:46:27
12           13          New 2006-02-15 09:46:27
13           14       Sci-Fi 2006-02-15 09:46:27
14           15       Sports 2006-02-15 09:46:27
15           16       Travel 2006-02-15 09:46:27

1)Ile kategorii filmów mamy w wypożyczalni?

In [3]:
df = pd.read_sql('select * from category',con=connection)
nr_of_category = max(df.category_id)
print("Ilość kategorii filmów w wypożyczalni: {}".format(nr_of_category))

Ilość kategorii filmów w wypożyczalni: 16

2)Wyświetl listę kategorii w kolejności alfabetycznej.

In [4]:
df = pd.read_sql('select name from category order by name  ',con=connection)
print(df)

           name
0        Action
1     Animation
2      Children
3      Classics
4        Comedy
5   Documentary
6         Drama
7        Family
8       Foreign
9         Games
10       Horror
11        Music
12          New
13       Sci-Fi
14       Sports
15       Travel

3)Znajdź najstarszy i najmłodszy film do wypożyczenia.

In [5]:
df = pd.read_sql('select title,release_year from film order by release_year DESC',con=connection)
print(df)
print('Wszystkie filmy są równie stare')

                 title  release_year
0      Chamber Italian          2006
1     Grosse Wonderful          2006
2      Airport Pollock          2006
3    Bright Encounters          2006
4     Academy Dinosaur          2006
..                 ...           ...
995     Young Language          2006
996         Youth Kick          2006
997       Zhivago Core          2006
998  Zoolander Fiction          2006
999          Zorro Ark          2006

[1000 rows x 2 columns]
Wszystkie filmy są równie stare

4)Ile wypożyczeń odbyło się między 2005-07-01 a 2005-08-01?

In [6]:
df = pd.read_sql('select * from rental ',con=connection)
print(df)

       rental_id         rental_date  ...  staff_id         last_update
0              2 2005-05-24 22:54:33  ...         1 2006-02-16 02:30:53
1              3 2005-05-24 23:03:39  ...         1 2006-02-16 02:30:53
2              4 2005-05-24 23:04:41  ...         2 2006-02-16 02:30:53
3              5 2005-05-24 23:05:21  ...         1 2006-02-16 02:30:53
4              6 2005-05-24 23:08:07  ...         1 2006-02-16 02:30:53
...          ...                 ...  ...       ...                 ...
16039      16046 2005-08-23 22:26:47  ...         2 2006-02-16 02:30:53
16040      16047 2005-08-23 22:42:48  ...         2 2006-02-16 02:30:53
16041      16048 2005-08-23 22:43:07  ...         1 2006-02-16 02:30:53
16042      16049 2005-08-23 22:50:12  ...         2 2006-02-16 02:30:53
16043          1 2005-05-24 22:53:30  ...         1 2006-02-15 21:30:53

[16044 rows x 7 columns]

In [7]:
df = pd.read_sql('select * from rental where rental_date between \'2005-07-01\'  and \'2005-08-01\' ',con=connection)
print(df)
print("Między 2005-07-01 a 2005-08-01 odbyło się {} wypożyczeń".format(max(df.index)+1))

      rental_id         rental_date  ...  staff_id         last_update
0          3470 2005-07-05 22:49:24  ...         1 2006-02-16 02:30:53
1          3471 2005-07-05 22:51:44  ...         2 2006-02-16 02:30:53
2          3472 2005-07-05 22:56:33  ...         2 2006-02-16 02:30:53
3          3473 2005-07-05 22:57:34  ...         1 2006-02-16 02:30:53
4          3474 2005-07-05 22:59:53  ...         1 2006-02-16 02:30:53
...         ...                 ...  ...       ...                 ...
6704      10176 2005-07-31 23:40:35  ...         2 2006-02-16 02:30:53
6705      10177 2005-07-31 23:42:33  ...         2 2006-02-16 02:30:53
6706      10178 2005-07-31 23:43:04  ...         1 2006-02-16 02:30:53
6707      10179 2005-07-31 23:49:54  ...         2 2006-02-16 02:30:53
6708      10180 2005-07-31 23:57:43  ...         2 2006-02-16 02:30:53

[6709 rows x 7 columns]
Między 2005-07-01 a 2005-08-01 odbyło się 6709 wypożyczeń

5)Ile wypożyczeń odbyło się między 2010-01-01 a 2011-02-01?

In [8]:
df = pd.read_sql('select * from rental where rental_date between between \'2010-01-01\'  and \'2011-02-01\' ',con=connection)
print(df)
print("Między między 2010-01-01 a 2011-02-01 odbyło się {} wypożyczeń".format(max(df.index)+1))

DatabaseError: ignored

Nie ma wypożyczeń między 2010-01-01 a 2011-02-01

6)Znajdź największą płatność wypożyczenia.

In [36]:
df = pd.read_sql('select * from payment order by amount DESC',con=connection)
df

       payment_id  customer_id  ...  amount               payment_date
0           23757          116  ...   11.99 2007-03-21 22:02:26.996577
1           28814          592  ...   11.99 2007-04-06 21:26:57.996577
2           29136           13  ...   11.99 2007-04-29 21:06:07.996577
3           22650          204  ...   11.99 2007-03-22 22:17:22.996577
4           28799          591  ...   11.99 2007-04-07 19:14:17.996577
...           ...          ...  ...     ...                        ...
14591       31942          354  ...    0.00 2007-05-14 13:44:29.996577
14592       32060          155  ...    0.00 2007-05-14 13:44:29.996577
14593       32079          208  ...    0.00 2007-05-14 13:44:29.996577
14594       32024           42  ...    0.00 2007-05-14 13:44:29.996577
14595       31966          448  ...    0.00 2007-05-14 13:44:29.996577

[14596 rows x 6 columns]

In [35]:
df = pd.read_sql('select * from payment where amount = \'11.99\' ',con=connection)
df

   payment_id  customer_id  ...  amount               payment_date
0       20403          362  ...   11.99 2007-03-21 21:57:24.996577
1       22650          204  ...   11.99 2007-03-22 22:17:22.996577
2       23757          116  ...   11.99 2007-03-21 22:02:26.996577
3       24553          195  ...   11.99 2007-03-23 20:47:59.996577
4       24866          237  ...   11.99 2007-03-02 20:46:39.996577
5       28799          591  ...   11.99 2007-04-07 19:14:17.996577
6       28814          592  ...   11.99 2007-04-06 21:26:57.996577
7       29136           13  ...   11.99 2007-04-29 21:06:07.996577

[8 rows x 6 columns]

7)Znajdź wszystkich klientów z Polski, Nigerii lub Bangladeszu.

In [34]:
df1 = pd.read_sql('select * from customer_list where country = \'Poland\'  or country = \'Bangladesh\' or country = \'Nigeria\' ',con=connection)
df1

     id              name  ...   notes sid
0   284     Sonia Gregory  ...  active   1
1   318       Brian Wyman  ...  active   1
2   572   Sidney Burleson  ...  active   1
3   409    Rodney Moeller  ...  active   2
4   332    Stephen Qualls  ...  active   1
5   286       Velma Lucas  ...  active   1
6    80      Marilyn Ross  ...  active   1
7   198      Elsie Kelley  ...  active   2
8   103   Gladys Hamilton  ...  active   1
9   329    Frank Waggoner  ...  active   2
10  128   Marjorie Tucker  ...  active   1
11   18      Carol Garcia  ...  active   2
12  270       Leah Curtis  ...  active   1
13  501       Ruben Geary  ...  active   1
14  277      Olga Jimenez  ...  active   2
15  156   Bertha Ferguson  ...  active   1
16  280    Tracey Barrett  ...  active   2
17  250         Jo Fowler  ...  active   2
18  571  Johnnie Chisholm  ...  active   2
19  562     Wallace Slone  ...  active   1
20   21    Michelle Clark  ...  active   1
21  380   Russell Brinson  ...  active   1
22  558  Jimmie Eggleston  ...  active   1
23  232    Constance Reid  ...  active   2

[24 rows x 9 columns]

8)Gdzie mieszkają członkowie personelu?

In [33]:
df1 = pd.read_sql('select * from staff_list' ,con=connection)
df1

   id          name               address  ...        city    country sid
0   1  Mike Hillyer     23 Workhaven Lane  ...  Lethbridge     Canada   1
1   2  Jon Stephens  1411 Lillydale Drive  ...   Woodridge  Australia   2

[2 rows x 8 columns]

In [13]:
df1 = pd.read_sql('select distinct address,city,country from staff_list' ,con=connection)
print(df1)

                address        city    country
0  1411 Lillydale Drive   Woodridge  Australia
1     23 Workhaven Lane  Lethbridge     Canada

9)Ilu pracowników mieszka w Argentynie lub Hiszpanii?

In [14]:
df1 = pd.read_sql('select count(*) from staff_list where country = \'Argentina\' or country = \'Spain\'',con=connection)
print("Ilość pracowników z Argentyny i Hiszpanii: {}".format(df1.at[0,'count']))

Ilość pracowników z Argentyny i Hiszpanii: 0

10)Jakie kategorie filmów zostały wypożyczone przez klientów?

In [30]:
df1 = pd.read_sql('''
  select name from category where category_id in  
    (select distinct category_id from film_category where film_id in 
      (select film_id from inventory where inventory_id in 
        (select inventory_id from rental where customer_id in 
          (select id from customer_list)
        )
      )
    )''',con=connection)
print(df1)

           name
0        Family
1        Travel
2        Sports
3      Classics
4        Action
5           New
6        Comedy
7        Horror
8      Children
9        Sci-Fi
10        Music
11        Games
12      Foreign
13  Documentary
14    Animation
15        Drama

11)Znajdź wszystkie kategorie filmów wypożyczonych w Ameryce.

In [31]:
df1 = pd.read_sql('''
  select name from category where category_id in  
    (select distinct category_id from film_category where film_id in 
      (select film_id from inventory where inventory_id in 
        (select inventory_id from rental where customer_id in 
          (select id from customer_list where country = \'United States\')
        )
      )
    )''',con=connection)
print(df1)

           name
0        Family
1        Travel
2        Sports
3      Classics
4        Action
5           New
6        Comedy
7        Horror
8      Children
9        Sci-Fi
10        Music
11        Games
12      Foreign
13  Documentary
14    Animation
15        Drama

12)Znajdź wszystkie tytuły filmów, w których grał: Olympia Pfeiffer lub Julia Zellweger lub Ellen Presley

In [32]:
df1 = pd.read_sql('select * from film_list ',con=connection)
df1

      fid  ...                                             actors
0       1  ...  Mary Keitel, Rock Dukakis, Oprah Kilmer, Warre...
1       2  ...  Chris Depp, Sean Guiness, Minnie Zellweger, Bo...
2       3  ...  Julianne Dench, Ray Johansson, Cameron Streep,...
3       4  ...  Oprah Kilmer, Fay Winslet, Kenneth Pesci, Scar...
4       5  ...  Thora Temple, Matthew Carrey, Matthew Leigh, D...
..    ...  ...                                                ...
992   996  ...  Mena Hopper, Christopher West, James Pitt, Jul...
993   997  ...  Mary Keitel, Ian Tandy, Scarlett Bening, Val B...
994   998  ...  William Hackman, Kenneth Hoffman, Salma Nolte,...
995   999  ...  Jada Ryder, Whoopi Hurt, Penelope Cronyn, Mary...
996  1000  ...             Lisa Monroe, Nick Degeneres, Ian Tandy

[997 rows x 8 columns]

In [116]:
df1 = pd.read_sql('select title from film_list where actors like \'%Ellen Presley%\' or actors like \'%Olympia Pfeiffer%\' or actors like \'%Julia Zellweger%\' ',con=connection)
print(df1)

                   title
0            Badman Dawn
1        Bilko Anonymous
2   Breakfast Goldfinger
3      Caribbean Liberty
4       Casper Dragonfly
..                   ...
64             Turn Star
65            Wait Cider
66          Women Dorado
67             Won Dares
68         Wyoming Storm

[69 rows x 1 columns]